Revit 2024 API
BeamSystemJustifyType Enumeration
Describes the justify method of beamsystem.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum BeamSystemJustifyType
Visual Basic
Public Enumeration BeamSystemJustifyType
Visual C++
public enum class BeamSystemJustifyType
Members
Member name | Description
Center | Center.
End | End.
Beginning | Beginning.
DirectionLine | DirectionLine.
See Also
Autodesk.Revit.DB Namespace